JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Libraries/inc/cw32l012_lpi2c.h
/**
 * @file cw32l012_lpi2c.h
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2021
 *
 */

/*******************************************************************************
 *
 * 代码许可和免责信息
 * 武汉力源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
 * 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉力源半
 * 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
 * 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
 * 或条件。
 * 无论何种情形，武汉力源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
 * 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
 * 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
 * 损失。
 * 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
 * 全部上述排除或限制可能并不适用于您。
 *
 *******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L012X_I2C_H
#define __CW32L012X_I2C_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "cw32l012.h"


/* Private_TypesDefinitions --------------------------------------------------*/
typedef int32_t      status_t;

/******************************************************************************/
/* Global enum type definitions                                               */
/******************************************************************************/
/** @defgroup I2C枚举类型定义
 * @{
 */

/**
 * @brief I2C 主从模式
 */
typedef enum
{
    I2C_ROLE_MASTER                         = 0,                                   /*!< 主机模式 */
    I2C_ROLE_SLAVE                                                                 /*!< 从机模式 */
} I2C_RoleTypeDef;

/**
* @brief I2C 从机地址模式
  */
typedef enum
{
    I2C_ADDRESS_7BIT                        = 0,                                   /*!< 7bit slaveAddr mode */
    I2C_ADDRESS_10BIT                                                              /*!< 10bit slaveAddr mode */
} I2C_AddressTypeDef;

/**
  * @brief I2C 从机寄存器地址模式
  */
typedef enum
{
    I2C_REG_ADDR_8BIT                       = 0,                                   /*!< 8bit slave Register Address */
    I2C_REG_ADDR_16BIT,                                                            /*!< 16bit slave Register Address */
    I2C_REG_ADDR_24BIT,                                                            /*!< 24bit slave Register Address */
    I2C_REG_ADDR_32BIT                                                             /*!< 32bit slave Register Address */
} I2C_SlaveRegAddrTypeDef;

/**
  * @brief I2C 读/写模式
  */
typedef enum
{
    I2C_MODE_WRITE                          = 0,                                   /*!< Master Write mode */
    I2C_MODE_READ                                                                  /*!< Master Read mode */
} I2C_ModeTypeDef;

/**
  * @brief I2C 时钟来源
  */
typedef enum
{
    I2C_CLK_SRC_PCLK                        = (0x0UL << I2Cx_MCR0_CLKSRC_Pos),      /*!< PCLK */
    I2C_CLK_SRC_LSE                         = (0x2UL << I2Cx_MCR0_CLKSRC_Pos),      /*!< LSE */
    I2C_CLK_SRC_LSI                         = (0x3UL << I2Cx_MCR0_CLKSRC_Pos),      /*!< LSI */
} I2C_MasterClkSrcTypeDef;

/**
  * @brief I2C 主机时钟分频系数
  */
typedef enum
{
    I2C_TCLK_Prescaler_Div1                 = 0,
    I2C_TCLK_Prescaler_Div2,
    I2C_TCLK_Prescaler_Div4,
    I2C_TCLK_Prescaler_Div8,
    I2C_TCLK_Prescaler_Div16,
    I2C_TCLK_Prescaler_Div32,
    I2C_TCLK_Prescaler_Div64,
    I2C_TCLK_Prescaler_Div128,
} I2C_TclkPrecaleTypeDef;

/**
  * @brief I2C slave 时钟延展和滤波时钟来源
  */
typedef enum
{
    I2C_CLK_SRC_PCLK_SLV                    = (0x0UL << I2Cx_SCR0_CLKSRC_Pos),     /*!< PCLK */
    I2C_CLK_SRC_LSE_SLV                     = (0x2UL << I2Cx_SCR0_CLKSRC_Pos),     /*!< LSE */
    I2C_CLK_SRC_LSI_SLV                     = (0x3UL << I2Cx_SCR0_CLKSRC_Pos),     /*!< LSI */
} I2C_SlaveClkSrcTypeDef;

/**
  * @brief I2C SDA 输入信号来源
  */
typedef enum
{
    I2C_SDA_INSRC_GPIO                      = (0x0UL << I2Cx_INSEL_SDAINSEL_Pos),  /*!< I2Cx_SDA管脚 */
    I2C_SDA_INSRC_VC1_OUT                   = (0x1UL << I2Cx_INSEL_SDAINSEL_Pos),  /*!< VC1_OUT */
    I2C_SDA_INSRC_VC2_OUT                   = (0x2UL << I2Cx_INSEL_SDAINSEL_Pos),  /*!< VC2_OUT */
    I2C_SDA_INSRC_VC3_OUT                   = (0x3UL << I2Cx_INSEL_SDAINSEL_Pos),  /*!< VC3_OUT */
    I2C_SDA_INSRC_VC4_OUT                   = (0x4UL << I2Cx_INSEL_SDAINSEL_Pos),  /*!< VC4_OUT */
} I2C_SdaInSrcTypeDef;

/**
  * @brief I2C SCL 输入信号来源
  */
typedef enum
{
    I2C_SCL_INSRC_GPIO                      = (0x0UL << I2Cx_INSEL_SCLINSEL_Pos),  /*!< I2Cx_SCL管脚 */
    I2C_SCL_INSRC_VC1_OUT                   = (0x1UL << I2Cx_INSEL_SCLINSEL_Pos),  /*!< VC1_OUT */
    I2C_SCL_INSRC_VC2_OUT                   = (0x2UL << I2Cx_INSEL_SCLINSEL_Pos),  /*!< VC2_OUT */
    I2C_SCL_INSRC_VC3_OUT                   = (0x3UL << I2Cx_INSEL_SCLINSEL_Pos),  /*!< VC3_OUT */
    I2C_SCL_INSRC_VC4_OUT                   = (0x4UL << I2Cx_INSEL_SCLINSEL_Pos),  /*!< VC4_OUT */
} I2C_SclInSrcTypeDef;

/**
  * @brief I2C 主机数据匹配方式
  */
typedef enum
{
    I2C_ByteMatch_Prohibit                  = (0x0UL),                             /*!< 禁止数据匹配 */
    I2C_ByteMatch_1st_M0_Or_M1              = (0x2UL),                             /*!< 第一个字节匹配 MATCH0 或 MATCH1 */
    I2C_ByteMatch_Any_M0_Or_M1              = (0x3UL),                             /*!< 任意字节匹配 MATCH0 或 MATCH1 */
    I2C_ByteMatch_1stM0_And_2ndM1           = (0x4UL),                             /*!< 第一个字节匹配 MATCH0 且第二个字节匹配 MATCH1 */
    I2C_ByteMatch_AnyM0_And_NextM1          = (0x5UL),                             /*!< 任意字节匹配 MATCH0 且下一字节匹配 MATCH1 */
    I2C_ByteMatch_1stAndM1_MAT_M0AndM1      = (0x6UL),                             /*!< 第一个字节与 MATCH1 相与后的值匹配 MATCH0 与MATCH1 相与后的值 */
    I2C_ByteMatch_AnyAndM1_MAT_M0AndM1      = (0x7UL),                             /*!< 任 意 字 节 与 MATCH1 相 与 后 的 值 匹 配 MATCH0 与MATCH1 相与后的值 */
} I2C_DataMatchTypeDef;

/**
  * @brief I2C 从机地址比较方式
  */
typedef enum
{
    I2C_Addr0_7bit                          = 0x0UL,                               /*!< 比较 ADDR0(7bit) */
    I2C_Addr0_10bit,                                                               /*!< 比较 ADDR0(10bit) */
    I2C_Addr0_Or_Addr1_7bit,                                                       /*!< 比较 ADDR0(7bit) / 比较 ADDR1(7bit) */
    I2C_Addr0_Or_Addr1_10bit,                                                      /*!< 比较 ADDR0(10bit) / 比较 ADDR1(10bit) */
    I2C_Addr0_7bit_Or_Addr1_10bit,                                                 /*!< 比较 ADDR0(7bit) / 比较 ADDR1(10bit) */
    I2C_Addr0_10bit_Or_Addr1_7bit,                                                 /*!< 比较 ADDR0(10bit) / 比较 ADDR1(7bit) */
    I2C_Addr0_To_Addr1_7bit,                                                       /*!< 比较地址空间 ADDR0 ~ ADDR1，7bit 模式 */
    I2C_Addr0_To_Addr1_10bit,                                                      /*!< 比较地址空间 ADDR0 ~ ADDR1，10bit 模式 */
} I2C_SlaveAddrCfgTypeDef;

/**
  * @brief I2C 主机待执行的指令
  */
enum I2C_MASTER_CMD
{
    I2C_Cmd_Tx_Data                         = (0x0UL << I2Cx_MTDR_CMD_Pos),        /*!< 向总线发送一个字节数据 MTDR[7:0] */
    I2C_Cmd_Rx_DataToMRDR                   = (0x1UL << I2Cx_MTDR_CMD_Pos),        /*!< 从总线接收（MTDR[7:0]+1）个字节数据，存入MRDR寄存器 */
    I2C_Cmd_Tx_STOP                         = (0x2UL << I2Cx_MTDR_CMD_Pos),        /*!< 在总线上产生 STOP 信号 */
    I2C_Cmd_Rx_Data_BypassMRDR              = (0x3UL << I2Cx_MTDR_CMD_Pos),        /*!< 从总线接收（MTDR[7:0]+1）个字节数据， 不存入MRDR 寄存器 */
    I2C_Cmd_Tx_RepSTART_Data_Rx_ACK         = (0x4UL << I2Cx_MTDR_CMD_Pos),        /*!< 在总线上生成（Repeated）START 信号，并向总线发送一个字节数据 MTDR[7:0]，期待从总线收到 ACK */
    I2C_Cmd_Tx_RepSTART_Data_Rx_NACK        = (0x5UL << I2Cx_MTDR_CMD_Pos),        /*!< 在总线上生成（Repeated）START 信号，并向总线发送一个字节数据 MTDR[7:0]，期待从总线收到 NACK */
    I2C_Cmd_Tx_RepSTART_Data_Rx_ACK_HS      = (0x6UL << I2Cx_MTDR_CMD_Pos),        /*!< 在高速模式下生成（Repeated）START 信号，并向总线发送一个字节数据 MTDR[7:0]，期待从总线收到 ACK */
    I2C_Cmd_Tx_RepSTART_Data_Rx_NACK_HS     = (0x7UL << I2Cx_MTDR_CMD_Pos),        /*!< 在高速模式下生成（Repeated）START 信号，并向总线发送一个字节数据 MTDR[7:0]，期待从总线收到 NACK */
} ;

/**
  * @brief I2C 总线状态字
  */
enum I2C_STATUS
{
    I2C_Status_Success = 0,
    I2C_Status_Busy,                                                               /*!< The master is already performing a transfer. */
    I2C_Status_Idle,                                                               /*!< The slave driver is idle. */
    I2C_Status_Nak,                                                                /*!< The slave device sent a NAK in response to a byte. */
    I2C_Status_FifoError,                                                          /*!< FIFO under run or overrun. */
    I2C_Status_BitError,                                                           /*!< Transferred bit was not seen on the bus. */
    I2C_Status_ArbitrationLost,                                                    /*!< Arbitration lost error. */
    I2C_Status_PinLowTimeout,                                                      /*!< SCL or SDA were held low longer than the timeout. */
    I2C_Status_NoTransferInProgress,                                               /*!< Attempt to abort a transfer when one is not in progress. */
    I2C_Status_DmaRequestFail,                                                     /*!< DMA request failed. */
    I2C_Status_Timeout,                                                            /*!< Timeout poling status flags. */
    I2C_Status_Error,
};

/* Private_Defines -----------------------------------------------------------*/
//I2C从设备地址，按照7/10 BIT设置
#define I2C_SLAVEADDRESS_EEPROM             (0xA0 >> 1)                            //读EEPROM时设置为(0xA0>>1)

#ifndef I2C_WAIT_TIMEOUT
#define I2C_WAIT_TIMEOUT                    0x100U                                 //Best to adjust this value according to MCU's HCLK frequency.
#endif

/*! @brief Retry times for waiting flag. */
#ifndef I2C_RETRY_TIMES
#define I2C_RETRY_TIMES                     0U                                     /* Define to zero means keep waiting until the flag is assert/deassert. */
#endif

#define MAX_SLAVE_ADDR_7B                   (0x7F)
#define MAX_SLAVE_ADDR_10B                  (0x3FF)
#define I2C_SLAVE_ADDR10B_MSB_MASK          (0x300)
#define I2C_SLAVE_ADDR10B_LSB_MASK          (0x0FF)
#define I2C_SLAVE_ADDR10B_MSB               (0xF0)                                 //b11110XXY
#define MAX_DATA_LEN_RX                     (1024UL)
#define MAX_DATA_LEN_EEPROM                 (256UL)
#define MAX_SIZE_SUBADDRESS                 (4UL)

#define IS_I2C_ALL_PERIPH(PERIPH)           (((PERIPH) == CW_I2C1) || ((PERIPH) == CW_I2C2))

#define I2C_CMD_TX_DATA                     (0U)
#define I2C_CMD_RX_DATA                     (1UL << I2Cx_MTDR_CMD_Pos)
#define I2C_CMD_STOP                        (2UL << I2Cx_MTDR_CMD_Pos)
#define I2C_CMD_START                       (4UL << I2Cx_MTDR_CMD_Pos)

/**
  * @defgroup I2C_Interrupts & Flags of I2C Master
  */
#define ENABLE_IT_MASK                      (0xFFFF80FC)                           // 定义清除I2C_MISR特定位的掩码
#define CLEAR_IT_MASK                       (0xFFFF80FF)                           // 定义清除I2C_MICR特定位的掩码
#define POLLING_IT_MASK                     (0xFCFF80FC)                           // 定义查询I2C_MISR特定位的掩码
// 中断标志位定义
#define I2C_IT_BUSBUSY                      (I2Cx_MISR_BUSBUSY_Msk)
#define I2C_IT_MSTBUSY                      (I2Cx_MISR_MSTBUSY_Msk)
#define I2C_IT_MATCH                        (I2Cx_MISR_MATCH_Msk)
#define I2C_IT_PINLOW                       (I2Cx_MISR_PINLOW_Msk)
#define I2C_IT_FIFO                         (I2Cx_MISR_FIFO_Msk)
#define I2C_IT_ARBI                         (I2Cx_MISR_ARBI_Msk)
#define I2C_IT_NACK                         (I2Cx_MISR_NACK_Msk)
#define I2C_IT_STOP                         (I2Cx_MISR_STOP_Msk)
#define I2C_IT_PACKET                       (I2Cx_MISR_PACKET_Msk)
#define I2C_IT_FRAME                        (I2Cx_MISR_FRAME_Msk)
#define I2C_IT_RXNE                         (I2Cx_MISR_RXNE_Msk)
#define I2C_IT_TXE                          (I2Cx_MISR_TXE_Msk)

// 检查中断标志位
#define IS_I2C_IT(IT)                       ((((IT) & POLLING_IT_MASK) == 0UL) && ((IT) != 0UL))
// 检查清除中断标志位
#define IS_I2C_CLEAR_IT(IT)                 ((((IT) & CLEAR_IT_MASK) == 0UL) && ((IT) != 0UL))
// 检查使能中断标志位
#define IS_I2C_ENABLE_IT(IT)                ((((IT) & ENABLE_IT_MASK) == 0UL) && ((IT) != 0UL))
// 检查标志位
#define IS_I2C_FLAG(FLAG)                   ((((FLAG) & POLLING_IT_MASK) == 0UL) && ((FLAG) != 0UL))
// 检查清除标志位
#define IS_I2C_CLEAR_FLAG(FLAG)             ((((FLAG) & CLEAR_IT_MASK) == 0UL) && ((FLAG) != 0UL))

/**
  * @defgroup I2C_Interrupts & Flags of I2C Slave
  */
#define ENABLE_IT_MASK_SLV                  (0xFFFF00F0)                           // 定义清除I2C_SISR特定位的掩码
#define CLEAR_IT_MASK_SLV                   (0xFFFFF0FF)                           // 定义清除I2C_SICR特定位的掩码
#define POLLING_IT_MASK_SLV                 (0xFCFF00F0)                           // 定义查询I2C_SISR特定位的掩码
// 中断标志位定义
#define I2C_IT_BUSBUSY_SLV                  (I2Cx_SISR_BUSBUSY_Msk)
#define I2C_IT_SLVBUSY_SLV                  (I2Cx_SISR_SLVBUSY_Msk)
#define I2C_IT_ALERT_SLV                    (I2Cx_SISR_ALERT_Msk)
#define I2C_IT_GC_SLV                       (I2Cx_SISR_GC_Msk)
#define I2C_IT_AM1_SLV                      (I2Cx_SISR_AM1_Msk)
#define I2C_IT_AM0_SLV                      (I2Cx_SISR_AM0_Msk)
#define I2C_IT_FIFO_SLV                     (I2Cx_SISR_FIFO_Msk)
#define I2C_IT_BIT_SLV                      (I2Cx_SISR_BIT_Msk)
#define I2C_IT_STOP_SLV                     (I2Cx_SISR_STOP_Msk)
#define I2C_IT_RESTART_SLV                  (I2Cx_SISR_RESTART_Msk)
#define I2C_IT_TACK_SLV                     (I2Cx_SISR_TACK_Msk)
#define I2C_IT_ADDR_SLV                     (I2Cx_SISR_ADDR_Msk)
#define I2C_IT_RXNE_SLV                     (I2Cx_SISR_RXNE_Msk)
#define I2C_IT_TXE_SLV                      (I2Cx_SISR_TXE_Msk)

// 检查中断标志位
#define IS_I2C_IT_SLV(IT)                   ((((IT) & POLLING_IT_MASK_SLV) == 0UL) && ((IT) != 0UL))
// 检查清除中断标志
#define IS_I2C_CLEAR_IT_SLV(IT)             ((((IT) & CLEAR_IT_MASK_SLV) == 0UL) && ((IT) != 0UL))
// 检查使能中断标志
#define IS_I2C_ENABLE_IT_SLV(IT)            ((((IT) & ENABLE_IT_MASK_SLV) == 0UL) && ((IT) != 0UL))
// 检查标志
#define IS_I2C_FLAG_SLV(FLAG)               ((((FLAG) & POLLING_IT_MASK_SLV) == 0UL) && ((FLAG) != 0UL))
// 检查清除标志
#define IS_I2C_CLEAR_FLAG_SLV(FLAG)         ((((FLAG) & CLEAR_IT_MASK_SLV) == 0UL) && ((FLAG) != 0UL))

