JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Libraries/inc/cw32l012_lpi2c.h
/** Array initializer of LPI2C peripheral base addresses */
#define LPI2C_BASE_ADDRS                    { 0u, I2C1_BASE, I2C2_BASE,}
/** Array initializer of LPI2C peripheral base pointers */
#define LPI2C_BASE_PTRS                     { (I2C_TypeDef *)0u, CW_I2C1, CW_I2C2}
/** Interrupt vectors for the LPI2C peripheral type */
#define LPI2C_IRQS                          { Reset_IRQn, I2C1_IRQn, I2C2_IRQn}
#define FSL_FEATURE_I2C_FIFO_SIZEn(x)       (1)

//I2C Master
#define I2C_MCR1_RDMO(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR1_RDMO_Pos)) & I2Cx_MCR1_RDMO_Msk)

#define I2C_MCR2_MATCFG(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR2_MATCFG_Pos)) & I2Cx_MCR2_MATCFG_Msk)
#define I2C_MCR2_PINCFG(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR2_PINCFG_Pos)) & I2Cx_MCR2_PINCFG_Msk)
#define I2C_MCR2_IGNACK(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR2_IGNACK_Pos)) & I2Cx_MCR2_IGNACK_Msk)
#define I2C_MCR2_PRESCALE(x)                (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR2_PRESCALE_Pos)) & I2Cx_MCR2_PRESCALE_Msk)

#define I2C_MCR3_BUSIDLE(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR3_BUSIDLE_Pos)) & I2Cx_MCR3_BUSIDLE_Msk)
#define I2C_MCR3_FILTSCL(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR3_FLTSCL_Pos)) & I2Cx_MCR3_FLTSCL_Msk)
#define I2C_MCR3_FILTSDA(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR3_FLTSDA_Pos)) & I2Cx_MCR3_FLTSDA_Msk)

#define I2C_MCR4_PINLOW(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR4_PINLOW_Pos)) & I2Cx_MCR4_PINLOW_Msk)

#define I2C_MCCR0_CLKLO(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MCCR_CLKLO_Pos)) & I2Cx_MCCR_CLKLO_Msk)
#define I2C_MCCR0_CLKHI(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MCCR_CLKHI_Pos)) & I2Cx_MCCR_CLKHI_Msk)
#define I2C_MCCR0_SETHOLD(x)                (((uint32_t)(((uint32_t)(x)) << I2Cx_MCCR_SETHOLD_Pos)) & I2Cx_MCCR_SETHOLD_Msk)
#define I2C_MCCR0_DATAVD(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_MCCR_DATAVD_Pos)) & I2Cx_MCCR_DATAVD_Msk)

#define I2C_MTDR_CMD(x)                     (((uint32_t)(((uint32_t)(x)) << I2Cx_MTDR_CMD_Pos)) & I2Cx_MTDR_CMD_Msk)
#define I2C_MTDR_DATA(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_MTDR_DATA_Pos)) & I2Cx_MTDR_DATA_Msk)

#define I2C_MCR_MEN(x)                      (((uint32_t)(((uint32_t)(x)) << I2Cx_MCR0_MEN_Pos)) & I2Cx_MCR0_MEN_Msk)

#define I2C_MDER_TDDE(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_MDER_TXE_Pos)) & I2Cx_MDER_TXE_Msk)
#define I2C_MDER_RDDE(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_MDER_RXNE_Pos)) & I2Cx_MDER_RXNE_Msk)

#define I2C_MFCR_TXWATER(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_MFIFOCR_TXWATER_Pos)) & I2Cx_MFIFOCR_TXWATER_Msk)
#define I2C_MFCR_RXWATER(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_MFIFOCR_RXWATER_Pos)) & I2Cx_MFIFOCR_RXWATER_Msk)

#define I2C_MDMR_MATCH0(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MMATCH_MATCH0_Pos)) & I2Cx_MMATCH_MATCH0_Msk)
#define I2C_MDMR_MATCH1(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_MMATCH_MATCH1_Pos)) & I2Cx_MMATCH_MATCH1_Msk)
/*! @} */

//I2C Slave
#define I2C_SCR1_ADRSTALL(x)                (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_ADRSTALL_Pos)) & I2Cx_SCR1_ADRSTALL_Msk)
#define I2C_SCR1_RXSTALL(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_RXSTALL_Pos)) & I2Cx_SCR1_RXSTALL_Msk)
#define I2C_SCR1_TXSTALL(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_TXSTALL_Pos)) & I2Cx_SCR1_TXSTALL_Msk)
#define I2C_SCR1_ACKSTALL(x)                (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_ACKSTALL_Pos)) & I2Cx_SCR1_ACKSTALL_Msk)
#define I2C_SCR1_GCEN(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_GCEN_Pos)) & I2Cx_SCR1_GCEN_Msk)
#define I2C_SCR1_SAEN(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_ALERTEN_Pos)) & I2Cx_SCR1_ALERTEN_Msk)
#define I2C_SCR1_TXCFG(x)                   (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_TXCFG_Pos)) & I2Cx_SCR1_TXCFG_Msk)
#define I2C_SCR1_RXCFG(x)                   (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_RXCFG_Pos)) & I2Cx_SCR1_RXCFG_Msk)
#define I2C_SCR1_IGNACK(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_IGNACK_Pos)) & I2Cx_SCR1_IGNACK_Msk)
#define I2C_SCR1_HSMEN(x)                   (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_HSMEN_Pos)) & I2Cx_SCR1_HSMEN_Msk)
#define I2C_SCR1_ADDRCFG(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR1_ADDRCFG_Pos)) & I2Cx_SCR1_ADDRCFG_Msk)

#define I2C_SCR3_CLKHOLD(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR3_CLKHOLD_Pos)) & I2Cx_SCR3_CLKHOLD_Msk)
#define I2C_SCR3_DATAVD(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR3_DATAVD_Pos)) & I2Cx_SCR3_DATAVD_Msk)
#define I2C_SCR3_FILTSCL(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR3_FLTSCL_Pos)) & I2Cx_SCR3_FLTSCL_Msk)
#define I2C_SCR3_FILTSDA(x)                 (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR3_FLTSDA_Pos)) & I2Cx_SCR3_FLTSDA_Msk)

#define I2C_SCR0_SEN(x)                     (((uint32_t)(((uint32_t)(x)) << I2Cx_SCR0_SEN_Pos)) & I2Cx_SCR0_SEN_Msk)

#define I2C_SDER_AVDE(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_SDER_ADDR_Pos)) & I2Cx_SDER_ADDR_Msk)
#define I2C_SDER_RDDE(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_SDER_RXNE_Pos)) & I2Cx_SDER_RXNE_Msk)
#define I2C_SDER_TDDE(x)                    (((uint32_t)(((uint32_t)(x)) << I2Cx_SDER_TXE_Pos)) & I2Cx_SDER_TXE_Msk)

#define I2C_STAR_TXNACK(x)                  (((uint32_t)(((uint32_t)(x)) << I2Cx_STAR_TXNACK_Pos)) & I2Cx_STAR_TXNACK_Msk)
/*! @} */

/*!
 * @addtogroup lpi2c
 * @{
 */

/* ! @brief LPI2C master fifo commands. */
enum
{
    kTxDataCmd                              = I2C_MTDR_CMD(0x0U),                  /*!< Transmit DATA[7:0] */
    kRxDataCmd                              = I2C_MTDR_CMD(0X1U),                  /*!< Receive (DATA[7:0] + 1) bytes */
    kStopCmd                                = I2C_MTDR_CMD(0x2U),                  /*!< Generate STOP condition */
    kStartCmd                               = I2C_MTDR_CMD(0x4U),                  /*!< Generate(repeated) START and transmit address in DATA[[7:0] */
};

/*!
 * @brief Default watermark values.
 *
 * The default watermarks are set to zero.
 */
enum
{
    kDefaultTxWatermark                     = 0,
    kDefaultRxWatermark                     = 0,
};

