JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Libraries/inc/cw32l012_lpi2c.h
/*! @brief States for the state machine used by transactional APIs. */
enum
{
    kIdleState                              = 0,
    kSendCommandState,
    kIssueReadCommandState,
    kTransferDataState,
    kStopState,
    kWaitForCompletionState,
};


/*! \public
 * @brief Generic status return codes.
 */
enum
{
    kStatus_Success                         = 0,                                   /*!< Generic status for Success. */
    kStatus_Fail                            = 1,                                   /*!< Generic status for Fail. */
    kStatus_ReadOnly                        = 2,                                   /*!< Generic status for read only failure. */
    kStatus_OutOfRange                      = 3,                                   /*!< Generic status for out of range access. */
    kStatus_InvalidArgument                 = 4,                                   /*!< Generic status for invalid argument check. */
    kStatus_Timeout                         = 5,                                   /*!< Generic status for timeout. */
    kStatus_NoTransferInProgress            = 6,                                   /*!< Generic status for no transfer in progress. */
    kStatus_Busy                            = 7,                                   /*!< Generic status for module is busy. */
    kStatus_NoData                          = 8,                                   /*!< Generic status for no data is found for the operation. */
};

/*! @brief LPI2C status return codes. */
enum
{
    kStatus_LPI2C_Busy                      = 100,                                 /*!< The master is already performing a transfer. */
    kStatus_LPI2C_Idle                      = 101,                                 /*!< The slave driver is idle. */
    kStatus_LPI2C_Nak                       = 102,                                 /*!< The slave device sent a NAK in response to a byte. */
    kStatus_LPI2C_FifoError                 = 103,                                 /*!< FIFO under run or overrun. */
    kStatus_LPI2C_BitError                  = 104,                                 /*!< Transferred bit was not seen on the bus. */
    kStatus_LPI2C_ArbitrationLost           = 105,                                 /*!< Arbitration lost error. */
    kStatus_LPI2C_PinLowTimeout             = 106,                                 /*!< SCL or SDA were held low longer than the timeout. */
    kStatus_LPI2C_NoTransferInProgress      = 107,                                 /*!< Attempt to abort a transfer when one is not in progress. */
    kStatus_LPI2C_DmaRequestFail            = 108,                                 /*!< DMA request failed. */
    kStatus_LPI2C_Timeout                   = 109,                                 /*!< Timeout polling status flags. */
};

/*! @} */

/*!
 * @addtogroup lpi2c_master_driver
 * @{
 */

/*!
 * @brief LPI2C master peripheral flags.
 *
 * @note These enums are meant to be OR'd together to form a bit mask.
 */
enum _lpi2c_master_flags
{
    kLPI2C_MasterTxReadyFlag                = I2Cx_MISR_TXE_Msk,                   /*!< Transmit data flag */
    kLPI2C_MasterRxReadyFlag                = I2Cx_MISR_RXNE_Msk,                  /*!< Receive data flag */
    kLPI2C_MasterEndOfPacketFlag            = I2Cx_MISR_PACKET_Msk,                /*!< End Packet flag */
    kLPI2C_MasterStopDetectFlag             = I2Cx_MISR_STOP_Msk,                  /*!< Stop detect flag */
    kLPI2C_MasterNackDetectFlag             = I2Cx_MISR_NACK_Msk,                  /*!< NACK detect flag */
    kLPI2C_MasterArbitrationLostFlag        = I2Cx_MISR_ARBI_Msk,                  /*!< Arbitration lost flag */
    kLPI2C_MasterFifoErrFlag                = I2Cx_MISR_FIFO_Msk,                  /*!< FIFO error flag */
    kLPI2C_MasterPinLowTimeoutFlag          = I2Cx_MISR_PINLOW_Msk,                /*!< Pin low timeout flag */
    kLPI2C_MasterDataMatchFlag              = I2Cx_MISR_MATCH_Msk,                 /*!< Data match flag */
    kLPI2C_MasterBusyFlag                   = I2Cx_MISR_MSTBUSY_Msk,               /*!< Master busy flag */
    kLPI2C_MasterBusBusyFlag                = I2Cx_MISR_BUSBUSY_Msk,               /*!< Bus busy flag */

    /*! All flags which are cleared by the driver upon starting a transfer. */
    kLPI2C_MasterClearFlags                 = I2Cx_MISR_MATCH_Msk   | I2Cx_MISR_PINLOW_Msk  |
                                              I2Cx_MISR_FIFO_Msk    | I2Cx_MISR_ARBI_Msk    |
                                              I2Cx_MISR_NACK_Msk    | I2Cx_MISR_STOP_Msk    |
                                              I2Cx_MISR_PACKET_Msk,

    /*! IRQ sources enabled by the non-blocking transactional API. */
    kLPI2C_MasterIrqFlags                   = I2Cx_MIER_MATCH_Msk  | I2Cx_MIER_PINLOW_Msk |
                                              I2Cx_MIER_FIFO_Msk   | I2Cx_MIER_ARBI_Msk   |
                                              I2Cx_MIER_NACK_Msk   | I2Cx_MIER_STOP_Msk   |
                                              I2Cx_MIER_PACKET_Msk | I2Cx_MIER_RXNE_Msk   |
                                              I2Cx_MIER_TXE_Msk,
    /*! Errors to check for. */
    kLPI2C_MasterErrorFlags                 = kLPI2C_MasterNackDetectFlag | kLPI2C_MasterArbitrationLostFlag |
                                              kLPI2C_MasterFifoErrFlag    | kLPI2C_MasterPinLowTimeoutFlag,
};

/*! @brief LPI2C pin configuration. */
typedef enum _lpi2c_master_pin_config
{
    kLPI2C_2PinOpenDrain                    = 0x0U,                                /*!< LPI2C Configured for 2-pin open drain mode */
    kLPI2C_2PinOutputOnly                   = 0x1U,                                /*!< LPI2C Configured for 2-pin output only mode (ultra-fast mode) */
    kLPI2C_2PinPushPull                     = 0x2U,                                /*!< LPI2C Configured for 2-pin push-pull mode */
    kLPI2C_4PinPushPull                     = 0x3U,                                /*!< LPI2C Configured for 4-pin push-pull mode */
    kLPI2C_2PinOpenDrainWithSeparateSlave   = 0x4U,                                /*!< LPI2C Configured for 2-pin open drain mode with separate LPI2C slave */
    kLPI2C_2PinOutputOnlyWithSeparateSlave  = 0x5U,                                /*!< LPI2C Configured for 2-pin output only mode(ultra-fast mode) with separate LPI2C slave */
    kLPI2C_2PinPushPullWithSeparateSlave    = 0x6U,                                /*!< LPI2C Configured for 2-pin push-pull mode with separate LPI2C slave */
    kLPI2C_4PinPushPullWithInvertedOutput   = 0x7U,                                /*!< LPI2C Configured for 4-pin push-pull mode(inverted outputs) */
} lpi2c_master_pin_config_t;

/*! @brief LPI2C master host request selection. */
typedef enum _lpi2c_host_request_source
{
    kLPI2C_HostRequestExternalPin           = 0x0U,                                /*!< Select the LPI2C_HREQ pin as the host request input */
    kLPI2C_HostRequestInputTrigger          = 0x1U,                                /*!< Select the input trigger as the host request input */
} lpi2c_host_request_source_t;

/*! @brief LPI2C master host request pin polarity configuration. */
typedef enum _lpi2c_host_request_polarity
{
    kLPI2C_HostRequestPinActiveLow          = 0x0U,                                /*!< Configure the LPI2C_HREQ pin active low */
    kLPI2C_HostRequestPinActiveHigh         = 0x1U,                                /*!< Configure the LPI2C_HREQ pin active high */
} lpi2c_host_request_polarity_t;

/**
 * \brief I2C主机初始化结构体
 */
typedef struct
{
    uint32_t                                I2C_BaudRate_Hz;
    uint32_t                                busIdleTimeout_ns;                     /*!< Bus idle timeout in nanoseconds. Set to 0 to disable. */
    uint32_t                                pinLowTimeout_ns;                      /*!< Pin low timeout in nanoseconds. Set to 0 to disable. */
    I2C_DataMatchTypeDef                    I2C_DataMatchMode;
    I2C_MasterClkSrcTypeDef                 I2C_ClockSouce;
    I2C_SdaInSrcTypeDef                     I2C_SDA_Source;
    I2C_SclInSrcTypeDef                     I2C_SCL_Source;
    boolean_t                               I2C_InDebugState;
    boolean_t                               I2C_InDeepSleepState;
    boolean_t                               I2C_RxDataMatch;
    boolean_t                               I2C_TxFIFO_Autoload;
    boolean_t                               ignoreAck;                             /*!< Whether to ignore ACK/NACK. */
    uint8_t                                 sdaGlitchFilterWidth_ns;               /*!< Width in nanoseconds of glitch filter on SDA pin. Set to 0 to disable. */
    uint8_t                                 sclGlitchFilterWidth_ns;               /*!< Width in nanoseconds of glitch filter on SCL pin. Set to 0 to disable. */
    uint8_t                                 I2C_PinsConfig;
    struct
    {
        boolean_t                           enable;                                /*!< Enable host request. */
        lpi2c_host_request_source_t         source;                                /*!< Host request source. */
        lpi2c_host_request_polarity_t       polarity;                              /*!< Host request pin polarity. */
    } hostRequest;
} I2C_MasterConfigTypeDef;

/*! @brief LPI2C master data match configuration structure. */
typedef struct _lpi2c_match_config
{
    I2C_DataMatchTypeDef matchMode;                                                /*!< Data match configuration setting. */
    boolean_t rxDataMatchOnly;                                                     /*!< When set to TRUE, received data is ignored until a successful match. */
    uint32_t match0;                                                               /*!< Match value 0. */
    uint32_t match1;                                                               /*!< Match value 1. */
} lpi2c_data_match_config_t;

/* Forward declaration of the transfer descriptor and handle typedefs. */
typedef struct _lpi2c_master_transfer lpi2c_master_transfer_t;
typedef struct _lpi2c_master_handle lpi2c_master_handle_t;

/*!
 * @brief Master completion callback function pointer type.
 *
 * This callback is used only for the non-blocking master transfer API. Specify the callback you wish to use
 * in the call to LPI2C_MasterTransferCreateHandle().
 *
 * @param I2Cx The LPI2C peripheral base address.
 * @param completionStatus Either kStatus_Success or an error code describing how the transfer completed.
 * @param userData Arbitrary pointer-sized value passed from the application.
 */
typedef void (*lpi2c_master_transfer_callback_t)(I2C_TypeDef *I2Cx,
        lpi2c_master_handle_t *handle,
        status_t completionStatus,
        void *userData);

/*!
 * @brief Transfer option flags.
 *
 * @note These enumerations are intended to be OR'd together to form a bit mask of options for
 * the #_lpi2c_master_transfer::flags field.
 */
enum _lpi2c_master_transfer_flags
{
    kLPI2C_TransferDefaultFlag              = 0x00U,                               /*!< Transfer starts with a start signal, stops with a stop signal. */
    kLPI2C_TransferNoStartFlag              = 0x01U,                               /*!< Don't send a start condition, address, and sub address */
    kLPI2C_TransferRepeatedStartFlag        = 0x02U,                               /*!< Send a repeated start condition */
    kLPI2C_TransferNoStopFlag               = 0x04U,                               /*!< Don't send a stop condition. */
};

/*!
 * @brief Non-blocking transfer descriptor structure.
 *
 * This structure is used to pass transaction parameters to the LPI2C_MasterTransferNonBlocking() API.
 */
struct _lpi2c_master_transfer
{
    uint32_t flags;                                                                /*!< Bit mask of options for the transfer. See enumeration #_lpi2c_master_transfer_flags for
                                                                                       available options. Set to 0 or #kLPI2C_TransferDefaultFlag for normal transfers. */
    uint16_t slaveAddress;                                                         /*!< The 7-bit slave address. */
    I2C_ModeTypeDef direction;                                                     /*!< Either #I2C_MODE_READ or #I2C_MODE_WRITE. */
    uint32_t subaddress;                                                           /*!< Sub address. Transferred MSB first. */
    size_t subaddressSize;                                                         /*!< Length of sub address to send in bytes. Maximum size is 4 bytes. */
    void *data;                                                                    /*!< Pointer to data to transfer. */
    size_t dataSize;                                                               /*!< Number of bytes to transfer. */
};

/*!
 * @brief Driver handle for master non-blocking APIs.
 * @note The contents of this structure are private and subject to change.
 */
struct _lpi2c_master_handle
{
    uint8_t state;                                                                 /*!< Transfer state machine current state. */
    uint16_t remainingBytes;                                                       /*!< Remaining byte count in current state. */
    uint8_t *buf;                                                                  /*!< Buffer pointer for current state. */
    uint16_t commandBuffer[6];                                                     /*!< LPI2C command sequence. When all 6 command words are used:
                                                                                       Start&addr&write[1 word] + subaddr[4 words] + restart&addr&read[1 word] */
    lpi2c_master_transfer_t transfer;                                              /*!< Copy of the current transfer info. */
    lpi2c_master_transfer_callback_t completionCallback;                           /*!< Callback function pointer. */
    void *userData;                                                                /*!< Application data passed to callback. */
};

/*! @brief Typedef for master interrupt handler, used internally for LPI2C master interrupt APIs.
 */
typedef void (*lpi2c_master_isr_t)(I2C_TypeDef *I2Cx, void *handle);

/*! @} */

/*!
 * @addtogroup lpi2c_slave_driver
 * @{
 */

/*!
 * @brief LPI2C slave peripheral flags.
 *
 * @note These enumerations are meant to be OR'd together to form a bit mask.
 */
enum _lpi2c_slave_flags
{
    kLPI2C_SlaveTxReadyFlag                 = I2Cx_SISR_TXE_Msk,                   /*!< Transmit data flag */
    kLPI2C_SlaveRxReadyFlag                 = I2Cx_SISR_RXNE_Msk,                  /*!< Receive data flag */
    kLPI2C_SlaveAddressValidFlag            = I2Cx_SISR_ADDR_Msk,                  /*!< Address valid flag */
    kLPI2C_SlaveTransmitAckFlag             = I2Cx_SISR_TACK_Msk,                  /*!< Transmit ACK flag */
    kLPI2C_SlaveRepeatedStartDetectFlag     = I2Cx_SISR_RESTART_Msk,               /*!< Repeated start detect flag */
    kLPI2C_SlaveStopDetectFlag              = I2Cx_SISR_STOP_Msk,                  /*!< Stop detect flag */
    kLPI2C_SlaveBitErrFlag                  = I2Cx_SISR_BIT_Msk,                   /*!< Bit error flag */
    kLPI2C_SlaveFifoErrFlag                 = I2Cx_SISR_FIFO_Msk,                  /*!< FIFO error flag */
    kLPI2C_SlaveAddressMatch0Flag           = I2Cx_SISR_AM0_Msk,                   /*!< Address match 0 flag */
    kLPI2C_SlaveAddressMatch1Flag           = I2Cx_SISR_AM1_Msk,                   /*!< Address match 1 flag */
    kLPI2C_SlaveGeneralCallFlag             = I2Cx_SISR_GC_Msk,                    /*!< General call flag */
    kLPI2C_SlaveBusyFlag                    = I2Cx_SISR_SLVBUSY_Msk,               /*!< Master busy flag */
    kLPI2C_SlaveBusBusyFlag                 = I2Cx_SISR_BUSBUSY_Msk,               /*!< Bus busy flag */
    /*! All flags which are cleared by the driver upon starting a transfer. */
    kLPI2C_SlaveClearFlags                  = I2Cx_SISR_RESTART_Msk | I2Cx_SISR_STOP_Msk |
                                              I2Cx_SISR_BIT_Msk     | I2Cx_SISR_FIFO_Msk,
    /*! IRQ sources enabled by the non-blocking transactional API. */
    kLPI2C_SlaveIrqFlags                    = I2Cx_SIER_ALERT_Msk  | I2Cx_SIER_GC_Msk      |
                                              I2Cx_SIER_AM1_Msk    | I2Cx_SIER_AM0_Msk     |
                                              I2Cx_SIER_FIFO_Msk   | I2Cx_SIER_BIT_Msk     |
                                              I2Cx_SIER_STOP_Msk   | I2Cx_SIER_RESTART_Msk |
                                              I2Cx_SIER_TACK_Msk   | I2Cx_SIER_ADDR_Msk    |
                                              I2Cx_SIER_RXNE_Msk   | I2Cx_SIER_TXE_Msk,

    /*! Errors to check for. */
    kLPI2C_SlaveErrorFlags                  = I2Cx_SISR_FIFO_Msk   | I2Cx_SISR_BIT_Msk,
};

/**
 * \brief I2C从机初始化结构体
 */
typedef struct
{
    uint32_t                                sdaGlitchFilterWidth_ns;               /*!< Width in nanoseconds of the digital filter on the SDA signal. Set to 0 to disable. */
    uint32_t                                sclGlitchFilterWidth_ns;               /*!< Width in nanoseconds of the digital filter on the SCL signal. Set to 0 to disable. */
    uint32_t                                dataValidDelay_ns;                     /*!< Width in nanoseconds of the data valid delay. */
    uint32_t                                clockHoldTime_ns;                      /*!< Width in nanoseconds of the clock hold time. */
    I2C_SlaveClkSrcTypeDef                  I2C_ClockSouce;
    uint16_t                                I2C_Addr0;
    uint16_t                                I2C_Addr1;
    I2C_SlaveAddrCfgTypeDef                 addressMatchMode;
    I2C_SlaveRegAddrTypeDef                 I2C_RegAddr;
    boolean_t                               filterEnable;                          /*!< Enable digital glitch filter. */
    boolean_t                               enableGeneralCall;                     /*!< Enable general call address matching. */
    struct
    {
        boolean_t                           enableAck;                             /*!< Enables SCL clock stretching during slave-transmit address byte(s)
                                                                                      and slave-receiver address and data byte(s) to allow software to
                                                                                      write the Transmit ACK Register before the ACK or NACK is transmitted.
                                                                                      Clock stretching occurs when transmitting the 9th bit. When
                                                                                      enableAckSCLStall is enabled, there is no need to set either
                                                                                      enableRxDataSCLStall or enableAddressSCLStall. */
        boolean_t                           enableTx;                              /*!< Enables SCL clock stretching when the transmit data flag is set
                                                                                      during a slave-transmit transfer. */
        boolean_t                           enableRx;                              /*!< Enables SCL clock stretching when receive data flag is set during
                                                                                      a slave-receive transfer. */
        boolean_t                           enableAddress;                         /*!< Enables SCL clock stretching when the address valid flag is asserted. */
    } sclStall;

    boolean_t                               ignoreAck;                             /*!< Continue transfers after a NACK is detected. */
    boolean_t                               enableReceivedAddressRead;             /*!< Enable reading the address received address as the first byte of data. */
} I2C_SlaveConfigTypeDef;

/*!
 * @brief Set of events sent to the callback for non blocking slave transfers.
 *
 * @note These enumerations are meant to be OR'd together to form a bit mask of events.
 */
typedef enum _lpi2c_slave_transfer_event
{
    kLPI2C_SlaveAddressMatchEvent           = 0x01U,                               /*!< Received the slave address after a start or repeated start. */
    kLPI2C_SlaveTransmitEvent               = 0x02U,                               /*!< Callback is requested to provide data to transmit
                                                                                       (slave-transmitter role). */
    kLPI2C_SlaveReceiveEvent                = 0x04U,                               /*!< Callback is requested to provide a buffer in which to place received
                                                                                       data (slave-receiver role). */
    kLPI2C_SlaveTransmitAckEvent            = 0x08U,                               /*!< Callback needs to either transmit an ACK or NACK. */
    kLPI2C_SlaveRepeatedStartEvent          = 0x10U,                               /*!< A repeated start was detected. */
    kLPI2C_SlaveCompletionEvent             = 0x20U,                               /*!< A stop was detected, completing the transfer. */

    /*! Bit mask of all available events. */
    kLPI2C_SlaveAllEvents                   = kLPI2C_SlaveAddressMatchEvent | kLPI2C_SlaveTransmitEvent | kLPI2C_SlaveReceiveEvent |
                                              kLPI2C_SlaveTransmitAckEvent | kLPI2C_SlaveRepeatedStartEvent | kLPI2C_SlaveCompletionEvent,
} lpi2c_slave_transfer_event_t;

/*! @brief LPI2C slave transfer structure */
typedef struct _lpi2c_slave_transfer
{
    lpi2c_slave_transfer_event_t event;                                            /*!< Reason the callback is being invoked. */
    uint8_t receivedAddress;                                                       /*!< Matching address send by master. */
    uint8_t *data;                                                                 /*!< Transfer buffer */
    size_t dataSize;                                                               /*!< Transfer size */
    status_t completionStatus;                                                     /*!< Success or error code describing how the transfer completed. Only applies for
                                                                                       #kLPI2C_SlaveCompletionEvent. */
    size_t transferredCount;                                                       /*!< Number of bytes actually transferred since start or last repeated start. */
} lpi2c_slave_transfer_t;

/* Forward declaration. */
typedef struct _lpi2c_slave_handle lpi2c_slave_handle_t;

/*!
 * @brief Slave event callback function pointer type.
 *
 * @param I2Cx Base address for the LPI2C instance on which the event occurred.
 * @param transfer Pointer to transfer descriptor containing values passed to and/or from the callback.
 * @param userData Arbitrary pointer-sized value passed from the application.
 */
typedef void (*lpi2c_slave_transfer_callback_t)(I2C_TypeDef *I2Cx, lpi2c_slave_transfer_t *transfer, void *userData);

