JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Libraries/inc/cw32l012_lpi2c.h
/*!
 * @brief LPI2C slave handle structure.
 */
struct _lpi2c_slave_handle
{
    lpi2c_slave_transfer_t transfer;                                               /*!< LPI2C slave transfer copy. */
    boolean_t isBusy;                                                              /*!< Whether transfer is busy. */
    boolean_t wasTransmit;                                                         /*!< Whether the last transfer was a transmit. */
    uint32_t eventMask;                                                            /*!< Mask of enabled events. */
    uint32_t transferredCount;                                                     /*!< Count of bytes transferred. */
    lpi2c_slave_transfer_callback_t callback;                                      /*!< Callback function called at transfer event. */
    void *userData;                                                                /*!< Callback parameter passed to callback. */
};

/*! @brief Typedef for slave interrupt handler. */
typedef void (*lpi2c_slave_isr_t)(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle);
/*! @} */

/*******************************************************************************
 * Variables
 ******************************************************************************/

/* Private_Variables ---------------------------------------------------------*/

/* Private_FunctionPrototypes ------------------------------------------------*/

/* Private_Functions ---------------------------------------------------------*/

/* Public_Functions ----------------------------------------------------------*/

// I2C Master使能或禁能
void I2C_MasterCmd(I2C_TypeDef *I2Cx, FunctionalState NewState);
// I2C Slave使能或禁能
void I2C_SlaveCmd(I2C_TypeDef *I2Cx, FunctionalState NewState);
// I2C Master初始化
ErrorStatus I2C_MasterInit(I2C_TypeDef *I2Cx, I2C_MasterConfigTypeDef *I2C_MasterConfig, uint32_t sourceClock_Hz);
// I2C Slave初始化
ErrorStatus I2C_SlaveInit(I2C_TypeDef *I2Cx, I2C_SlaveConfigTypeDef *I2C_SlaveConfig, uint32_t sourceClock_Hz);
// I2C 去初始化
void I2C_DeInit(I2C_TypeDef *I2Cx);
void I2C_MasterDeinit(I2C_TypeDef *I2Cx);
void I2C_SlaveDeinit(I2C_TypeDef *I2Cx);
// I2C Master设置波特率
void I2C_MasterSetBaudRate(I2C_TypeDef *I2Cx, uint32_t sourceClock_Hz, uint32_t baudRate_Hz);
// 发送START/ReSTART信号
uint8_t I2C_MasterSTART_Addr7b(I2C_TypeDef *I2Cx, uint8_t slaveAddr, I2C_ModeTypeDef dataMode);
uint8_t I2C_MasterReSTART_Addr7b(I2C_TypeDef *I2Cx, uint8_t slaveAddr, I2C_ModeTypeDef dataMode);
uint8_t I2C_MasterSTART_Addr10b(I2C_TypeDef *I2Cx, uint16_t slaveAddr, I2C_ModeTypeDef dataMode);
uint8_t I2C_MasterReSTART_Addr10b(I2C_TypeDef *I2Cx, uint16_t slaveAddr, I2C_ModeTypeDef dataMode);
// 发送STOP信号
uint8_t I2C_MasterSTOP(I2C_TypeDef *I2Cx);
// I2C 主机接收
uint8_t I2C_MasterReceive(I2C_TypeDef *I2Cx, uint8_t *rxBuff, uint16_t rxSize);
// I2C 主机发送
uint8_t I2C_MasterSend(I2C_TypeDef *I2Cx, uint8_t *txBuff, uint16_t txSize);
// I2C 从机接收
uint8_t I2C_SlaveReceive(I2C_TypeDef *I2Cx, uint8_t *rxBuff, uint16_t *rxSize);
// I2C 从机发送
uint8_t I2C_SlaveSend(I2C_TypeDef *I2Cx, uint8_t *txBuff, uint16_t txSize);

void I2C_MasterSoftReset(I2C_TypeDef *I2Cx);
void I2C_SlaveSoftReset(I2C_TypeDef *I2Cx);
void I2C_MasterTxFIFOReset(I2C_TypeDef *I2Cx);
void I2C_MasterRxFIFOReset(I2C_TypeDef *I2Cx);
void I2C_SlaveTxFIFOReset(I2C_TypeDef *I2Cx);
void I2C_SlaveRxFIFOReset(I2C_TypeDef *I2Cx);
void I2C_MasterBusFilter(I2C_TypeDef *I2Cx, uint8_t SDAFilter, uint8_t SCLFilter);
void I2C_SlaveBusFilter(I2C_TypeDef *I2Cx, uint8_t SDAFilter, uint8_t SCLFilter);

void I2C_MasterClearFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);
uint8_t I2C_MasterPollingFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);
uint8_t I2C_MasterPollingFlagReverse(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);
static uint8_t I2C_MasterPollingFlagCommon(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG, boolean_t reverse);
uint32_t I2C_MasterGetFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);

void I2C_SlaveClearFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);
uint8_t I2C_SlavePollingFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);
uint8_t I2C_SlavePollingFlagReverse(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);
static uint8_t I2C_SlavePollingFlagCommon(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG, boolean_t reverse);
uint32_t I2C_SlaveGetFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);

void I2C_MasterInitDefault(I2C_MasterConfigTypeDef *masterConfig);
void I2C_SlaveInitDefault(I2C_SlaveConfigTypeDef *slaveConfig);

// 主写EEPROM函数
uint8_t I2C_MasterWriteEepromData(I2C_TypeDef *I2Cx, uint32_t regAddr, I2C_SlaveRegAddrTypeDef regAddrType, uint8_t *pu8Data, uint16_t u16Len);
// 主读EEPROM函数
uint8_t I2C_MasterReadEepromData(I2C_TypeDef *I2Cx, uint32_t regAddr, I2C_SlaveRegAddrTypeDef regAddrType, uint8_t *pu8Data, uint16_t u16Len);

// 主机发送X字节数据
uint8_t I2C_MasterSendDataToSlave(I2C_TypeDef *I2Cx, uint16_t slaveAddr, uint8_t *pu8Data, uint16_t u16Len);
// 主机读取X字节数据
uint8_t I2C_MasterReceiveDataFromSlave(I2C_TypeDef *I2Cx, uint16_t slaveAddr, uint8_t *pu8RegAddr, I2C_SlaveRegAddrTypeDef regAddrType, uint8_t *pu8Data, uint16_t u16Len);

void I2C_SlaveTxNAck(I2C_TypeDef *I2Cx, FunctionalState stateNAck);

static uint32_t I2C_GetCyclesForWidth(uint32_t sourceClock_Hz, uint32_t width_ns, uint32_t minCycles, uint32_t maxCycles, uint32_t prescaler);

uint32_t LPI2C_GetInstance(I2C_TypeDef *I2Cx);

/*!
 * @addtogroup lpi2c_master_driver
 * @{
 */

void LPI2C_MasterConfigureDataMatch(I2C_TypeDef *I2Cx, const lpi2c_data_match_config_t *matchConfig);

status_t LPI2C_MasterCheckAndClearError(I2C_TypeDef *I2Cx, uint32_t status);

status_t LPI2C_CheckForBusyBus(I2C_TypeDef *I2Cx);

/*@}*/

/*! @name Status */
/*@{*/

/**
 * @brief 获取LPI2C主模式状态标志
 *
 * 该函数用于获取指定LPI2C接口的主模式状态标志。
 *
 * @param I2Cx LPI2C接口指针，指向一个I2C_TypeDef结构体
 *
 * @return 返回LPI2C主模式状态标志，通过读取MSR寄存器获取
 */
static inline uint32_t LPI2C_MasterGetStatusFlags(I2C_TypeDef *I2Cx)
{
    return I2Cx->MISR;
}

/*@}*/

/*! @name Interrupts */
/*@{*/

/**
 * @brief 使能指定的I2C主模式中断
 *
 * 该函数用于使能I2C主模式下指定的中断。
 *
 * @param I2Cx 指向I2C外设的指针
 * @param interruptMask 要使能的中断掩码，可以是多个中断的组合
 */
static inline void LPI2C_MasterEnableInterrupts(I2C_TypeDef *I2Cx, uint32_t interruptMask)
{
    I2Cx->MIER |= interruptMask;
}

/**
 * @brief 禁用LPI2C主机中断
 *
 * 禁用指定LPI2C主机接口上的指定中断。
 *
 * @param I2Cx LPI2C主机接口指针，指向I2C_TypeDef类型的结构体。
 * @param interruptMask 要禁用的中断掩码，可以通过按位或运算组合多个中断标志。
 */
static inline void LPI2C_MasterDisableInterrupts(I2C_TypeDef *I2Cx, uint32_t interruptMask)
{
    I2Cx->MIER &= ~interruptMask;
}

/**
 * @brief 获取LPI2C主模式已启用的中断
 *
 * 获取指定LPI2C接口在主模式下已启用的中断。
 *
 * @param I2Cx LPI2C接口指针
 * @return 已启用的中断标志，具体值参考LPI2C模块的MIER寄存器
 */
static inline uint32_t LPI2C_MasterGetEnabledInterrupts(I2C_TypeDef *I2Cx)
{
    return I2Cx->MIER;
}

/*@}*/

/*! @name DMA control */
/*@{*/

/**
 * @brief 使能或禁用LPI2C主机模式下的DMA传输
 *
 * 使能或禁用指定LPI2C接口在主机模式下的DMA传输功能。
 *
 * @param I2Cx 指向LPI2C接口的指针
 * @param enableTx 是否使能TX DMA传输，TRUE表示使能，FALSE表示禁用
 * @param enableRx 是否使能RX DMA传输，TRUE表示使能，FALSE表示禁用
 */
static inline void LPI2C_MasterEnableDMA(I2C_TypeDef *I2Cx, boolean_t enableTx, boolean_t enableRx)
{
    I2Cx->MDER = I2C_MDER_TDDE(enableTx) | I2C_MDER_RDDE(enableRx);
}

/**
 * @brief 获取LPI2C主模式发送FIFO的数据
 *
 * 获取指定LPI2C接口的发送FIFO（MTDR）的数据。
 *
 * @param I2Cx LPI2C接口指针
 * @return 返回一个uint32_t类型的值，表示LPI2C主模式发送FIFO的数据
 */
static inline uint32_t LPI2C_MasterGetTxFifoAddress(I2C_TypeDef *I2Cx)
{
    return (uint32_t)&I2Cx->MTDR;
}

/**
 * @brief 获取LPI2C主设备接收FIFO的数据
 *
 * 获取LPI2C主设备接收FIFO的数据。
 *
 * @param I2Cx LPI2C模块指针
 *
 * @return 返回接收FIFO的数据
 */
static inline uint32_t LPI2C_MasterGetRxFifoAddress(I2C_TypeDef *I2Cx)
{
    return (uint32_t)&I2Cx->MRDR;
}

/*@}*/

/*! @name FIFO control */
/*@{*/

/**
 * @brief 设置LPI2C主模式传输和接收的水位标记
 *
 * 该函数用于设置LPI2C主模式下的传输和接收水位标记。
 *
 * @param I2Cx 指向I2C类型定义的指针，表示要配置的LPI2C实例
 * @param txWords 要设置的传输水位标记，单位为字（word）
 * @param rxWords 要设置的接收水位标记，单位为字（word）
 */
static inline void LPI2C_MasterSetWatermarks(I2C_TypeDef *I2Cx, size_t txWords, size_t rxWords)
{
    I2Cx->MFIFOCR = I2C_MFCR_TXWATER(txWords) | I2C_MFCR_RXWATER(rxWords);
}

/**
 * @brief I2C主机获取FIFO中TX和RX的计数值
 *
 * 该函数用于获取I2C主模式FIFO中TX和RX的计数值。
 *
 * @param I2Cx I2C模块指针
 * @param rxCount 指向存储RX计数值的变量的指针
 * @param txCount 指向存储TX计数值的变量的指针
 *
 * @return 无
 */
static inline void LPI2C_MasterGetFifoCounts(I2C_TypeDef *I2Cx, size_t *rxCount, size_t *txCount)
{
    if (NULL != txCount)
    {
        *txCount = (I2Cx->MFIFOSR & I2Cx_MFIFOSR_TXCNT_Msk) >> I2Cx_MFIFOSR_TXCNT_Pos;
    }

    if (NULL != rxCount)
    {
        *rxCount = (I2Cx->MFIFOSR & I2Cx_MFIFOSR_RXCNT_Msk) >> I2Cx_MFIFOSR_RXCNT_Pos;
    }
}

/*@}*/

