JWXL19733/WeGui_RGB/CW32L012/资料/CW32L012_StandardPeripheralLib_V1.0.1/Libraries/inc/cw32l012_lpi2c.h
/*! @name Bus operations */
/*@{*/

/**
 * @brief 主机获取I2C总线的空闲状态
 *
 * 获取指定I2C总线的空闲状态。如果总线处于忙碌状态，则返回FALSE；否则返回TRUE。
 *
 * @param I2Cx 指向I2C模块的指针
 *
 * @return 如果I2C总线空闲，则返回TRUE；否则返回FALSE
 */
static inline boolean_t LPI2C_MasterGetBusIdleState(I2C_TypeDef *I2Cx)
{
    return ((I2Cx->MISR & I2Cx_MISR_BUSBUSY_Msk) >> I2Cx_MISR_BUSBUSY_Pos) == 1U ? TRUE : FALSE;
}

status_t LPI2C_MasterSend(I2C_TypeDef *I2Cx, void *txBuff, size_t txSize);

status_t LPI2C_MasterReceive(I2C_TypeDef *I2Cx, void *rxBuff, size_t rxSize);

status_t LPI2C_MasterStop(I2C_TypeDef *I2Cx);

status_t LPI2C_MasterTransferBlocking(I2C_TypeDef *I2Cx, lpi2c_master_transfer_t *transfer);

/*@}*/

/*! @name Non-blocking */
/*@{*/
void LPI2C_MasterTransferCreateHandle(I2C_TypeDef *I2Cx,
                                      lpi2c_master_handle_t *handle,
                                      lpi2c_master_transfer_callback_t callback,
                                      void *userData);

status_t LPI2C_MasterTransferNonBlocking(I2C_TypeDef *I2Cx,
        lpi2c_master_handle_t *handle,
        lpi2c_master_transfer_t *transfer);

status_t LPI2C_MasterTransferGetCount(I2C_TypeDef *I2Cx, lpi2c_master_handle_t *handle, size_t *count);

void LPI2C_MasterTransferAbort(I2C_TypeDef *I2Cx, lpi2c_master_handle_t *handle);

/*@}*/

/*! @name IRQ handler */
/*@{*/
void LPI2C_MasterTransferHandleIRQ(I2C_TypeDef *I2Cx, void *lpi2cMasterHandle);

/*@}*/

/*! @} */

/*!
 * @addtogroup lpi2c_slave_driver
 * @{
 */

/**
 * @brief 获取LPI2C从设备状态标志
 *
 * 该函数用于获取指定的LPI2C从设备状态标志。
 *
 * @param I2Cx 指向I2C类型的指针，指向要操作的LPI2C从设备
 *
 * @return 返回从设备的状态标志，类型为uint32_t
 */
static inline uint32_t LPI2C_SlaveGetStatusFlags(I2C_TypeDef *I2Cx)
{
    return I2Cx->SISR;
}

/*@}*/

/*! @name Slave interrupts */
/*@{*/

/**
 * @brief 使能指定I2C从设备的中断
 *
 * 该函数用于使能指定I2C从设备的中断。通过向I2C从设备的SIER寄存器写入指定的中断掩码，
 * 来使能相应的中断。
 *
 * @param I2Cx 指向I2C设备的指针
 * @param interruptMask 需要使能的中断掩码，可以通过按位或操作组合多个中断标志
 */
static inline void LPI2C_SlaveEnableInterrupts(I2C_TypeDef *I2Cx, uint32_t interruptMask)
{
    I2Cx->SIER |= interruptMask;
}

/**
 * @brief 禁用I2C从设备的中断
 *
 * 该函数用于禁用指定I2C从设备的中断。
 *
 * @param I2Cx I2C设备指针
 * @param interruptMask 需要禁用的中断掩码
 */
static inline void LPI2C_SlaveDisableInterrupts(I2C_TypeDef *I2Cx, uint32_t interruptMask)
{
    I2Cx->SIER &= ~interruptMask;
}

/**
 * @brief 获取LPI2C从机使能的中断
 *
 * 获取指定I2C从机使能的中断状态。
 *
 * @param I2Cx 指向I2C模块的指针
 *
 * @return 返回I2Cx->SIER寄存器的值，即当前使能的中断状态
 */
static inline uint32_t LPI2C_SlaveGetEnabledInterrupts(I2C_TypeDef *I2Cx)
{
    return I2Cx->SIER;
}

/*@}*/

/*! @name Slave DMA control */
/*@{*/

/**
 * @brief 使能LPI2C从设备的DMA功能
 *
 * 该函数用于配置LPI2C从设备的DMA相关功能，包括地址有效性、接收和发送使能。
 *
 * @param I2Cx LPI2C设备指针，指向需要配置的LPI2C外设实例。
 * @param enableAddressValid 是否使能地址有效性检查。
 *                           TRUE: 使能地址有效性检查；
 *                           FALSE: 不使能地址有效性检查。
 * @param enableRx 是否使能DMA接收功能。
 *                TRUE: 使能DMA接收功能；
 *                FALSE: 不使能DMA接收功能。
 * @param enableTx 是否使能DMA发送功能。
 *                TRUE: 使能DMA发送功能；
 *                FALSE: 不使能DMA发送功能。
 */
static inline void LPI2C_SlaveEnableDMA(I2C_TypeDef *I2Cx, boolean_t enableAddressValid, boolean_t enableRx, boolean_t enableTx)
{
    I2Cx->SDER = (I2Cx->SDER & ~(I2Cx_SDER_ADDR_Msk | I2Cx_SDER_RXNE_Msk | I2Cx_SDER_TXE_Msk)) |
                 I2C_SDER_AVDE(enableAddressValid) | I2C_SDER_RDDE(enableRx) | I2C_SDER_TDDE(enableTx);
}

/*@}*/

/*! @name Slave bus operations */
/*@{*/

/**
 * @brief 从设备获取LPI2C的总线空闲状态
 *
 * 该函数用于从设备获取指定LPI2C的总线空闲状态。
 *
 * @param I2Cx LPI2C设备实例指针
 *
 * @return 返回一个布尔值，表示总线是否空闲：
 *         - TRUE：总线空闲
 *         - FALSE：总线忙碌
 */
static inline boolean_t LPI2C_SlaveGetBusIdleState(I2C_TypeDef *I2Cx)
{
    return ((I2Cx->SISR & I2Cx_SISR_BUSBUSY_Msk) >> I2Cx_SISR_BUSBUSY_Pos) == 1U ? TRUE : FALSE;
}

/**
 * @brief 从设备发送应答或非应答信号
 *
 * 该函数用于在I2C通信过程中，从设备发送应答（ACK）或非应答（NACK）信号。
 *
 * @param I2Cx I2C设备指针，指向需要操作的I2C设备。
 * @param ackOrNack 应答信号标志，传入TRUE表示发送应答信号，传入FALSE表示发送非应答信号。
 */
static inline void LPI2C_SlaveTransmitAck(I2C_TypeDef *I2Cx, boolean_t ackOrNack)
{
    I2Cx->STAR = I2C_STAR_TXNACK(!ackOrNack);
}

/**
 * @brief LPI2C从设备获取接收到的地址
 *
 * 该函数从指定的LPI2C设备的状态和控制寄存器中获取从设备接收到的地址。
 *
 * @param I2Cx 指向I2C设备类型的指针
 *
 * @return 返回接收到的地址
 */
static inline uint32_t LPI2C_SlaveGetReceivedAddress(I2C_TypeDef *I2Cx)
{
    return I2Cx->SASR & I2Cx_SASR_RADDR_Msk;
}

status_t LPI2C_SlaveSend(I2C_TypeDef *I2Cx, void *txBuff, size_t txSize, size_t *actualTxSize);

status_t LPI2C_SlaveReceive(I2C_TypeDef *I2Cx, void *rxBuff, size_t rxSize, size_t *actualRxSize);

/*@}*/

/*! @name Slave non-blocking */
/*@{*/

void LPI2C_SlaveTransferCreateHandle(I2C_TypeDef *I2Cx,
                                     lpi2c_slave_handle_t *handle,
                                     lpi2c_slave_transfer_callback_t callback,
                                     void *userData);

status_t LPI2C_SlaveTransferNonBlocking(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle, uint32_t eventMask);

status_t LPI2C_SlaveTransferGetCount(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle, size_t *count);

void LPI2C_SlaveTransferAbort(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle);

/*@}*/

/*! @name Slave IRQ handler */
/*@{*/
void LPI2C_SlaveTransferHandleIRQ(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle);

void LPI2C_CommonIRQHandler(I2C_TypeDef *I2Cx, uint32_t instance);

#ifdef __cplusplus
}

#endif

#endif /*__CW32L012_LPI2C_H */
